rails5_ora/app/controllers/oracle_test_controller.rb

SELECT "DBA_TABLESPACES".* FROM "DBA_TABLESPACES" WHERE (Tablespace_Name IN ('SYSTEM','SYSAUX','TEMP') )
---
  def bind_xy_result
    ts = DbaTablespace.where(@sql_param).all   # Load structure
    @length = ts.length       # Ensure execution of Select
    @result = DbaTablespace.where(@sql_param).all
    @length = @result.length       # Ensure execution of Select