rails5_ora/app/controllers/oracle_test_controller.rb

  def bind_array
    exec_code('where with Array', %{DbaTablespace.where(["Tablespace_Name = ? ", 'SYSTEM']).all})
---
SELECT "DBA_TABLESPACES".* FROM "DBA_TABLESPACES" WHERE (Tablespace_Name = 'SYSTEM' )

  def bind_hash
    exec_code('where with Hash', %{DbaTablespace.where({ tablespace_name: 'SYSTEM' }).all})
---
SELECT "DBA_TABLESPACES".* FROM "DBA_TABLESPACES" WHERE (Tablespace_Name = 'SYSTEM' )

  def bind_array_collection
    exec_code('where with IN and Array with Collection', %{DbaTablespace.where(["Tablespace_Name IN (?) ", ['SYSTEM', 'SYSAUX', 'TEMP']]).all})
---
SELECT "DBA_TABLESPACES".* FROM "DBA_TABLESPACES" WHERE (Tablespace_Name IN ('SYSTEM','SYSAUX','TEMP') )

  def bind_hash_collection
    exec_code('where with IN and Hash with Collection', %{DbaTablespace.where({tablespace_name: ['SYSTEM', 'SYSAUX', 'TEMP']}).all})
---
SELECT "DBA_TABLESPACES".* FROM "DBA_TABLESPACES" WHERE "DBA_TABLESPACES"."TABLESPACE_NAME" = :a1  [["tablespace_name", "SYSTEM"]]

  def bind_freeform
    exec_code('where with free form parameter', %{DbaTablespace.where(#{params[:freeform]}).all})
---
SELECT "DBA_TABLESPACES".* FROM "DBA_TABLESPACES" WHERE (Tablespace_Name = 'SYSTEM' )

  def find_each_array
    @code = %{DbaDataFile.find_each(start: 0, batch_size: 1000)}
---
SELECT "DBA_DATA_FILES".* FROM "DBA_DATA_FILES" WHERE "DBA_DATA_FILES"."FILE_ID" >= :a1 ORDER BY "DBA_DATA_FILES"."FILE_ID" ASC FETCH FIRST :a2 ROWS ONLY  [["file_id", "0.0"], ["LIMIT", 1000]]